---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.Duct
zh: 风管
source: html/39c3794d-667d-13cb-5b78-6f0a6898fc3e.htm
---
# Duct Methods

**中文**: 风管

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.